
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СотрудникиПоВахтам
	Движения.СотрудникиПоВахтам.Записывать = Истина;
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.СотрудникиПоВахтам.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Вахта = ТекСтрокаСотрудники.Вахта;
		Движение.СтаршийСмены = ТекСтрокаСотрудники.СтаршийСмены;
	КонецЦикла;

КонецПроцедуры
