
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
   УстановитьПараметрСервер();
   
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрСервер()

  Настройки = Отчет.КомпоновщикНастроек.Настройки;
  ПодразделениеПользователя = ПараметрыСеанса.ТекущийПользователь.Подразделение;
  Если ЗначениеЗаполнено(ПодразделениеПользователя) Тогда
	  ОрганизацияПользователя = ПодразделениеПользователя.Организация;
  КонецЕсли;
  Если ЗначениеЗаполнено(ОрганизацияПользователя) Тогда 	
	  ПараметрОрганизация = Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	  Если ПараметрОрганизация = Неопределено Тогда
		  Возврат;
	  КонецЕсли;
	  Если Не ЗначениеЗаполнено(ПараметрОрганизация.Значение) Тогда
		  ПараметрОрганизация.Значение = ОрганизацияПользователя;
		  ПараметрОрганизация.Использование = Истина;
	  КонецЕсли;
  КонецЕсли;
  Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
  СкомпоноватьРезультат() 

КонецПроцедуры
