
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьБазовыеЕдиницы();
КонецПроцедуры

&НаСервере
Процедура РеагентПриИзмененииНаСервере()
	УстановитьБазовыеЕдиницы();
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьБазовыеЕдиницы()
	
	Если Не ЗначениеЗаполнено(Объект.Реагент) Тогда
		БазоваяЕдиницаКоличества   = Неопределено;
		БазоваяЕдиницаКонцентрации = Неопределено;
		БазоваяЕдиницаПлотности    = Неопределено;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("ВидРеагента", Объект.Реагент.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаКоличества = Выборка.ЕдиницаИзмеренияКоличества;
		БазоваяЕдиницаКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
		БазоваяЕдиницаПлотности = Выборка.ЕдиницаИзмеренияПлотности;
	КонецЕсли;
	
КонецПроцедуры