Функция ПолучитьУровень(Оборудование) Экспорт
	
	Уровень = 0;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УровеньРаствораВМерникеСрезПоследних.Уровень КАК Уровень
	|ИЗ
	|	РегистрСведений.УровеньРаствораВМернике.СрезПоследних(, Оборудование = &Оборудование) КАК УровеньРаствораВМерникеСрезПоследних");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Уровень = Выборка.Уровень;
	КонецЕсли;
	
	Возврат Уровень;
	
КонецФункции