
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	//Организация
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Организация");
	Если ЗначениеЗаполнено(ПараметрОрганизация.Значение) И Не ПараметрОрганизация.Значение = Организация Тогда
		Организация = ПараметрОрганизация.Значение;
		СменаСКД();
	КонецЕсли;  	
	
КонецПроцедуры 

Процедура СменаСКД()
	
	Если Организация.Наименование = "Ижевская ТЭЦ-2" Тогда
		СхемаКомпоновкиДанных = ПолучитьМакет("Макет");
	Иначе
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли; 	
	//!!! Гилев 83
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	УстановитьПараметрКомпоновщика("Организация", Организация);
	
КонецПроцедуры

Процедура УстановитьПараметрКомпоновщика(ИмяПараметра,ЗначениеПараметра)

	УстанавлиаемыйПараметр = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	ЗначениеУстПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(УстанавлиаемыйПараметр);
	Если Не ЗначениеУстПараметра = Неопределено Тогда
		ЗначениеУстПараметра.Значение = ЗначениеПараметра;
		ЗначениеУстПараметра.Использование = Истина;
	КонецЕсли;   	

КонецПроцедуры