
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого СтрТЧ Из Объект.СтатусыЗаявок Цикл
		ЗполнитьТипСтатусаЗаявок(СтрТЧ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Объект.Наименование = Объект.Пользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусыЗаявокНачальныйСтатусПриИзменении(Элемент)
	
	ЗполнитьТипСтатусаЗаявок(Элементы.СтатусыЗаявок.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗполнитьТипСтатусаЗаявок(СтрТЧ)
	
	Тип = ТипЗнч(СтрТЧ.НачальныйСтатус);
	
	Если Тип = Тип("ПеречислениеСсылка.СтатусыЗаявок") Тогда
		СтрТЧ.ТипСхемыСогласования = "Длинный путь согласования";
	ИначеЕсли Тип = Тип("ПеречислениеСсылка.СтатусыЗаявокСокращенный") Тогда
		СтрТЧ.ТипСхемыСогласования = "Сокраценный путь согласования";
	КонецЕсли;
	
КонецПроцедуры
