
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьНастройки();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьНастройки()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//Если Отчет.Организация.Наименование = "Ижевская ТЭЦ-2" Тогда
	//	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("Макет");
	//Иначе
		СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//КонецЕсли;
	Настройки = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки;
	
	//параметр Подразделение
	ПараметрОрганизация = Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	Если ПараметрОрганизация = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ПараметрОрганизация.Значение) Тогда
		ПараметрОрганизация.Значение = Отчет.Организация;
		ПараметрОрганизация.Использование = Истина;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	СкомпоноватьРезультат();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Отчет.Организация = Отчет.Подразделение.Организация;
	
КонецПроцедуры

 























