
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Подразделение", Подразделение);
	Параметры.Свойство("ВидЗаписи", ВидЗаписи);
	Параметры.Свойство("Событие", Событие);
	Для Каждого ТекСтр Из Параметры.мШаблоны Цикл
		НовСтр = мШаблоны.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура мШаблоныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть(мШаблоны[ВыбраннаяСтрока].Шаблон);
	
КонецПроцедуры




















