
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БезПодразделения = Истина;
	СПодразделением = Ложь;
	ПервичноеЗаполнение();
	УстановитьНастройки();
	
КонецПроцедуры

&НаСервере
Процедура ПервичноеЗаполнение()
	
	Отчет.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Отчет.ПериодОтчета.ДатаНачала = НачалоДня(ТекущаяДата() - 2*24*60*60);
	Отчет.ПериодОтчета.ДатаОкончания = КонецДня(ТекущаяДата());
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьНастройки()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//варианты
	СтруктураВариантов = Новый Структура;
	пВарианты = СхемаКомпоновкиДанных.ВариантыНастроек;
	Для Каждого пЭл ИЗ пВарианты Цикл
		СтруктураВариантов.Вставить(пЭл.Имя,пЭл.Настройки);
	КонецЦикла;
	Настройки = ?(БезПодразделения,СтруктураВариантов.Основной,СтруктураВариантов.СПодразделением);
	
	//параметр Подразделение
	ПараметрПодразделение = Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	Если ПараметрПодразделение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(ПараметрПодразделение.Значение) Тогда
		ПараметрПодразделение.Значение = Отчет.Подразделение;
		ПараметрПодразделение.Использование = Истина;
		Отчет.Подразделение = ПараметрПодразделение.Значение;
	КонецЕсли;
	//параметр ПериодОтчета
	ПараметрПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Если Не ЗначениеЗаполнено(ПараметрПериодОтчета.Значение) Тогда
		ПараметрПериодОтчета.Значение.ДатаНачала = Отчет.ПериодОтчета.ДатаНачала;
		ПараметрПериодОтчета.Значение.ДатаОкончания = Отчет.ПериодОтчета.ДатаОкончания;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	СкомпоноватьРезультат();	
	
КонецПроцедуры

&НаКлиенте
Процедура БезПодразделенияПриИзменении(Элемент)
	
	СПодразделением = Не БезПодразделения; 
	
	УстановитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура СПодразделениемПриИзменении(Элемент)
	
	БезПодразделения = Не СПодразделением; 
	
	УстановитьНастройки();
	
КонецПроцедуры


&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	УстановитьНастройки();
КонецПроцедуры

