
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// При вызове из классификатора.
	Если Параметры.Свойство("Код") Тогда
		Объект.Код = Параметры.Код;
	КонецЕсли;	
	
	Если Параметры.Свойство("Наименование") Тогда
		Объект.Наименование = Параметры.Наименование;
	КонецЕсли;
	
	Если Параметры.Свойство("МеждународноеСокращение") Тогда
		Объект.МеждународноеСокращение = Параметры.МеждународноеСокращение;
	КонецЕсли;
	
	Если Параметры.Свойство("НаименованиеПолное") Тогда
		Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
	КонецЕсли;	
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	//ВИ++
	//Заявки
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	КонецЕсли;
	//ВИ--
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.КлассификаторЕдиницИзмерения) Тогда
		Элементы.ФормаИзменить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СсылкаДляИзмененияПриИзменении(Элемент)
	
	ИзменениеСсылкиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеСсылкиСервер()
	
	Объект.Наименование = Объект.СсылкаДляИзменения.Наименование;
	Объект.НаименованиеПолное = Объект.СсылкаДляИзменения.НаименованиеПолное;
	Объект.МеждународноеСокращение = Объект.СсылкаДляИзменения.МеждународноеСокращение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаЗаявки.Видимость = ОтображатьГруппуЗаявок();
	Элементы.СсылкаДляИзменения.Видимость = ЗначениеЗаполнено(Объект.СсылкаДляИзменения) И ОтображатьГруппуЗаявок();
	Элементы.ФормаИзменить.Видимость = Не Объект.Ссылка.Пустая() И (Не ЗначениеЗаполнено(Объект.Статус) ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.Утверждена"));
	Элементы.СсылкаДляИзменения.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ЭтаФорма.Закрыть();
	
	Форма = ПолучитьФорму("Справочник.КлассификаторЕдиницИзмерения.Форма.ФормаЭлемента");
	ЗаполнитьЗначенияСвойств(Форма.Объект,Объект,,"Код"); 
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.НаРассмотрении");
	Форма.Объект.СсылкаДляИзменения = Объект.Ссылка;
	Форма.Открыть();
	
КонецПроцедуры

#КонецОбласти
