Функция ДокументУжеСоздан(мДокумент, ДатаДокумента, Подразделение) Экспорт 
	
	ИмяДокумента = мДокумент.Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументРапорта.Ссылка КАК Ссылка
		|ИЗ
		|	Документ."+ИмяДокумента+" КАК ДокументРапорта
		|ГДЕ
		|	ДокументРапорта.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|   И ДокументРапорта.Подразделение = &Подразделение
		|	И НЕ ДокументРапорта.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаДокумента));	
	Запрос.УстановитьПараметр("ИмяДокумента", ИмяДокумента);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		ДокументРапорта = Результат.Ссылка;
	Иначе
		ДокументРапорта = Неопределено;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДокументРапорта", ДокументРапорта);
	СтруктураДанных.Вставить("ИмяДокумента", ИмяДокумента);
	СтруктураДанных.Вставить("СинонимДокумента", мДокумент.Синоним);
	
	Возврат СтруктураДанных;
	
КонецФункции