
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Статус.Видимость = ОтображатьГруппуЗаявок();
	Элементы.ТипЗначения.Доступность = Объект.Ссылка.Пустая() И Не Объект.Заявка;
	
КонецПроцедуры  

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Заявка И (Объект.Статус = Перечисления.СтатусыЗаявок.НаРассмотрении ИЛИ Объект.Статус = Перечисления.СтатусыЗаявок.СогласованаПлощадкой
	        ИЛИ Объект.Статус = Перечисления.СтатусыЗаявок.Согласована);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Заявка = Истина;
		Объект.Статус = Перечисления.СтатусыЗаявок.НаРассмотрении;
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверкаСтатусаУспешно() Тогда
		ПоказатьПредупреждение(, "Можно утвердить только согласованные заявки!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверкаСтатусаУспешно()
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Утверждена") И Не Объект.Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласована") Тогда
		Объект.Статус = Объект.Ссылка.Статус;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
