
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОперативныйЖурнал.ПриСозданииНаСервере(Объект.Ссылка, Элементы, Объект);
	
	ПолучитьДанныеРегистраНастроек();
	ПолучитьДанныеРегистраНастроекУровень();
	
	//дорбавим 1 строку в шапку
	Если Объект.Ссылка.Пустая() И Объект.УровеньВБакахКонденсата.Количество() = 0 Тогда
		НовСтр = Объект.УровеньВБакахКонденсата.Добавить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСозданныйРанееДокумент()
	
	СтруктураДанных = РапортСервер.ДокументУжеСоздан(Объект.Ссылка.Метаданные(), Объект.Дата, Объект.Подразделение);
	АдресХранилища = ПоместитьВоВременноеХранилище(СтруктураДанных, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		ПроверитьНаСозданныйРанееДокумент();
		СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
		Если Не СтруктураДанных.ДокументРапорта = Неопределено Тогда
			Отказ = Истина;
			РапортКлиент.ПоказатьИнформациюПоРапорту(СтруктураДанных, ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму()
	
	Для Каждого ЭлементФормы Из ЭтаФорма.Элементы Цикл 	
		Если Тип(ЭлементФормы) = Тип("ПолеФормы") И ТипЗнч(ЭлементФормы.Родитель) = Тип("ТаблицаФормы") Тогда
			Если ЭлементФормы.Родитель.Имя = "УровеньВБакахКонденсата" Тогда
				Для инд = 1 По 15 Цикл
					Если ЭлементФормы.Имя = "УровеньВБакахКонденсатаЗначениеПоказателя" + инд Тогда
						СтруктураПараметра = ПолучитьНастройкиРегистраУровень("ЗначениеПоказателя" + инд);
						Если СтруктураПараметра.Количество() = 0 Тогда
							ЭлементФормы.Видимость = Ложь;
						Иначе 				
							ЭлементФормы.Видимость = Истина;
							ЭлементФормы.Заголовок = СтруктураПараметра.Синоним;
						КонецЕсли;				
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЭлементФормы.Родитель.Имя = "ЗначенияПоказателей" Тогда
				Для инд = 1 По 15 Цикл
					Если ЭлементФормы.Имя = "ЗначениеПоказателя" + инд Тогда
						СтруктураПараметра = ПолучитьНастройкиРегистра(ЭлементФормы.Имя);
						Если СтруктураПараметра.Количество() = 0 Тогда
							ЭлементФормы.Видимость = Ложь;
						Иначе 				
							ЭлементФормы.Видимость = Истина;
							ЭлементФормы.Заголовок = СтруктураПараметра.Синоним;
						КонецЕсли;				
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;  			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиРегистра(ИмяПоказателя)
	
	СтруктураПараметра = Новый Структура;
	
	Для Каждого ТекСтр Из ДанныеРегистраНастроек Цикл
		Если ТекСтр.ЗначениеПоказателя = ИмяПоказателя Тогда
			СтруктураПараметра.Вставить("Синоним", ТекСтр.Синоним);
			СтруктураПараметра.Вставить("ТипЗначения", ТекСтр.ТипЗначения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметра;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНастройкиРегистраУровень(ИмяПоказателя)
	
	СтруктураПараметра = Новый Структура;
	
	Для Каждого ТекСтр Из ДанныеРегистраНастроекУровень Цикл
		Если ТекСтр.ЗначениеПоказателя = ИмяПоказателя Тогда
			СтруктураПараметра.Вставить("Синоним", ТекСтр.Синоним);
			СтруктураПараметра.Вставить("ТипЗначения", ТекСтр.ТипЗначения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПараметра;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеРегистраНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаЗначенийПоказателейТеплосетевоеОборудование.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	НастройкаЗначенийПоказателейТеплосетевоеОборудование.Синоним КАК Синоним,
		|	НастройкаЗначенийПоказателейТеплосетевоеОборудование.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	РегистрСведений.НастройкаЗначенийПоказателейТеплосетевоеОборудование КАК НастройкаЗначенийПоказателейТеплосетевоеОборудование
		|ГДЕ
		|	НастройкаЗначенийПоказателейТеплосетевоеОборудование.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ДанныеРегистраНастроек.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеРегистраНастроекУровень()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкаЗначенийПоказателейУровеньВБакахКонденсата.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	НастройкаЗначенийПоказателейУровеньВБакахКонденсата.Синоним КАК Синоним,
		|	НастройкаЗначенийПоказателейУровеньВБакахКонденсата.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	РегистрСведений.НастройкаЗначенийПоказателейУровеньВБакахКонденсата КАК НастройкаЗначенийПоказателейУровеньВБакахКонденсата
		|ГДЕ
		|	НастройкаЗначенийПоказателейУровеньВБакахКонденсата.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	ДанныеРегистраНастроекУровень.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ЗначениеПоказателяНачалоВыбора(Элемент)
	
	ТипЗначения = ПолучитьНастройкиРегистра(Элемент.Имя).ТипЗначения;
	
	Если ТипЗнч(ТипЗначения) = Тип("Строка") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Число") Тогда
		КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Дата") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Дата");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателяШапкаНачалоВыбора(Элемент, инд)
	
	ТипЗначения = ПолучитьНастройкиРегистраУровень("ЗначениеПоказателя" + инд).ТипЗначения;
	
	Если ТипЗнч(ТипЗначения) = Тип("Строка") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Число") Тогда
		КвалификаторыЧисла = Новый КвалификаторыЧисла(10, 2, ДопустимыйЗнак.Любой);
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Число", КвалификаторыЧисла);
	ИначеЕсли ТипЗнч(ТипЗначения) = Тип("Дата") Тогда
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("Дата");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры  

&НаКлиенте
Процедура ЗначениеПоказателя2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)  	
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры 

&НаКлиенте
Процедура ЗначениеПоказателя3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя6НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя7НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя8НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя9НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя10НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя11НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя12НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя13НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя14НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоказателя15НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяНачалоВыбора(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 1);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 2);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 3);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя4НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 4);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя5НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 5);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя6НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 6);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя7НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 7);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя8НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 8);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя9НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 9);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя10НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 10);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя11НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 11);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя12НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 12);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя13НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 13);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя14НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 14);
КонецПроцедуры

&НаКлиенте
Процедура УровеньВБакахКонденсатаЗначениеПоказателя15НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗначениеПоказателяШапкаНачалоВыбора(Элемент, 15);
КонецПроцедуры










