
&НаСервере
Процедура УстановитьПоУмолчаниюНаСервере(Ссылка)
	УстановитьПривилегированныйРежим(Истина);
	МЗ = РегистрыСведений.ВидРасходаРеагентовПоУмолчанию.СоздатьМенеджерЗаписи();
	МЗ.Организация = Ссылка.Организация;
	МЗ.ВидРасходаРеагентов = Ссылка;
	МЗ.Записать();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоУмолчанию(Команда)
	ТекСтр = Элементы.Список.ТекущаяСтрока;
	УстановитьПоУмолчаниюНаСервере(ТекСтр);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не РольДоступна("ДобавлениеИзменениеВидовРасходаРеагентов") И Не РольДоступна("ПолныеПрава") Тогда
		Элементы.ФормаУстановитьПоУмолчанию.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
