
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	
	Шаблоны.Параметры.УстановитьЗначениеПараметра("Организация", Подразделение.Организация);
	Шаблоны.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтаФорма.Закрыть(Элементы.Шаблоны.ТекущиеДанные);
	
КонецПроцедуры
