
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Ответственный.ТолькоПросмотр = Не РольДоступна("ПолныеПрава");
	
	ОрганизацияПред = Объект.Организация;
	
	ЗаполнитьКоличествоБазовойЕдИзм();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если РольДоступна("ИспользованиеОбработкиПересчетПоказателейЖурналаУчетаХимреагентов") Или РольДоступна("ПолныеПрава") Тогда
		ЕстьСписениеПоДокументу();
	Иначе
		ЕстьСписениеПоДокументу = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// 

&НаКлиенте
Процедура ОтветНаВопросОПересчете(Ответ, ДопПараметры) Экспорт
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЕдиницыИзмерения(Комплект = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КомплектыУчетныхЕдиниц.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	КомплектыУчетныхЕдиниц.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	КомплектыУчетныхЕдиниц.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	Справочник.КомплектыУчетныхЕдиниц КАК КомплектыУчетныхЕдиниц
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &Комплект = НЕОПРЕДЕЛЕНО
	|				ТОГДА КомплектыУчетныхЕдиниц.Ссылка В
	|						(ВЫБРАТЬ
	|							КомплектУчетныхЕдиницПоУмолчанию.Комплект КАК Комплект
	|						ИЗ
	|							РегистрСведений.КомплектУчетныхЕдиницПоУмолчанию КАК КомплектУчетныхЕдиницПоУмолчанию
	|						ГДЕ
	|							КомплектУчетныхЕдиницПоУмолчанию.Организация = &Организация
	|							И КомплектУчетныхЕдиницПоУмолчанию.Реагент = &Реагент)
	|			ИНАЧЕ КомплектыУчетныхЕдиниц.Ссылка = &Комплект
	|		КОНЕЦ");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Реагент", Объект.Реагент);
	Запрос.УстановитьПараметр("Комплект", Комплект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ЕдиницаИзмеренияКоличества = Выборка.ЕдиницаИзмеренияКоличества;
		Объект.ЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
		Объект.ЕдиницаИзмеренияПлотности = Выборка.ЕдиницаИзмеренияПлотности;
	Иначе
		Объект.ЕдиницаИзмеренияКоличества = Неопределено;
		Объект.ЕдиницаИзмеренияКонцентрации = Неопределено;
		Объект.ЕдиницаИзмеренияПлотности = Неопределено;
	КонецЕсли;
	
	ЗаполнитьКоличествоБазовойЕдИзм();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидРеагента(Реагент)
	Возврат Реагент.ВидРеагента;
КонецФункции

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Реагент) Тогда
		Объект.ВидРеагента = ПолучитьВидРеагента(Объект.Реагент);
		ЗаполнитьЕдиницыИзмерения();
	Иначе
		Объект.ВидРеагента = Неопределено;
		Объект.ЕдиницаИзмеренияКоличества = Неопределено;
		Объект.ЕдиницаИзмеренияКонцентрации = Неопределено;
		Объект.ЕдиницаИзмеренияПлотности = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияКоличестваПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОргЕд(Подразделение)
	Возврат Подразделение.Организация;
КонецФункции

&НаСервере
Процедура ПриВыбореКомплектаЕдиниц(Комплект, ДопПараметры) Экспорт
	
	Если Комплект <> Неопределено Тогда
		ЗаполнитьЕдиницыИзмерения(Комплект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницыИзмерения1(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриВыбореКомплектаЕдиниц", ЭтотОбъект);;
	Отбор = Новый Структура("Организация, Реагент", ПолучитьОргЕд(Объект.Подразделение), Объект.Реагент);
	ОткрытьФорму("Справочник.КомплектыУчетныхЕдиниц.ФормаВыбора", Новый Структура("Отбор", Отбор),,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоБазовойЕдИзм()
	
	Коэфф1 = 0;
	Коэфф2 = 0;
	Коэфф3 = 0;
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияКоличества) Тогда
		Коэфф1 = Объект.ЕдиницаИзмеренияКоличества.Коэффициент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияКонцентрации) Тогда
		Коэфф2 = Объект.ЕдиницаИзмеренияКонцентрации.Коэффициент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияПлотности) Тогда
		Коэфф3 = Объект.ЕдиницаИзмеренияПлотности.Коэффициент;
	КонецЕсли;
	
	КоличКоэфф1 = Коэфф1 * Объект.Количество;
	КоличКоэфф2 = Коэфф2 * Объект.Концентрация;
	КоличКоэфф3 = Коэфф3 * Объект.Плотность;
	КоличКоэфф4 =  КоличКоэфф1 * КоличКоэфф2 / 100;
	
	Если Объект.УчитыватьПлотностьПриРасчетеКоличества 
		И ЗначениеЗаполнено(Объект.Плотность) 
		И ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияПлотности)
		И ЗначениеЗаполнено(Объект.ЕдиницаИзмеренияПлотности.Коэффициент)		
		Тогда
		
		КоличКоэфф1 = КоличКоэфф1 * Объект.Плотность * Коэфф3;
		КоличКоэфф4 = КоличКоэфф4 * Объект.Плотность * Коэфф3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	ЗаполнитьКоличествоБазовойЕдИзм();
КонецПроцедуры

&НаКлиенте
Процедура КонцентрацияПриИзменении(Элемент)
	ЗаполнитьКоличествоБазовойЕдИзм();
КонецПроцедуры

&НаКлиенте
Процедура ПлотностьПриИзменении(Элемент)
	ЗаполнитьКоличествоБазовойЕдИзм();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаВходящегоДокумента) Тогда
		Объект.ДатаВходящегоДокумента = Объект.Дата;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.Организация = ПолучитьОргЕд(Объект.Подразделение);	
	Если ОрганизацияПред <> Объект.Организация Тогда
		
		ЗаполнитьЕдиницыИзмерения();
		
		ОрганизацияПред = Объект.Организация;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьПлотностьПриРасчетеКоличестваПриИзменении(Элемент)
	ЗаполнитьКоличествоБазовойЕдИзм();
КонецПроцедуры

&НаСервере
Процедура ЕстьСписениеПоДокументу()
	
	ЕстьСписениеПоДокументу = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИспользованиеРеагентов.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ИспользованиеРеагентов КАК ИспользованиеРеагентов
		|ГДЕ
		|	ИспользованиеРеагентов.Партия = &Партия");
		Запрос.УстановитьПараметр("Партия", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			ЕстьСписениеПоДокументу = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры
