
&НаКлиенте
Процедура ЗаписьОЖ(Команда)
	
	СформироватьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокумент() 
	
	мФормаДок = ПолучитьФорму("Документ.ОперативныйЖурнал.Форма.мФормаДокумента");
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	мФормаДок.Объект.ВидЗаписи = ТекДанные.ВидЗаписи;
	мФормаДок.Объект.Событие = ТекДанные.Событие;
	мФормаДок.Объект.мШаблон = ТекДанные.ШаблонТекста;
	мФормаДок.ОбновитьСодержаниеЗаписи();
	
	мФормаДок.Открыть();
	
	Если Не мФормаДок.Открыта() Тогда 
		мФормаДок = Неопределено;
		Отказ = Истина;
		Возврат;
	КонецЕсли;    	
	
КонецПроцедуры
















