
Функция ПолучитьАктуальнуюЗаписьОборудования(Оборудование, ВидЗаписи, Период = '00010101') Экспорт
	
	СостояниеОборудования = Новый Структура;
	
	СостояниеОборудования.Вставить("Период", '00010101');
	СостояниеОборудования.Вставить("Уровень", 0);
	СостояниеОборудования.Вставить("Концентрация", 0);
	СостояниеОборудования.Вставить("ВремяРаботы", 0);
	СостояниеОборудования.Вставить("ВидРеагента", Неопределено);
	СостояниеОборудования.Вставить("Подразделение", Неопределено);
	СостояниеОборудования.Вставить("Включено", Ложь);
	СостояниеОборудования.Вставить("Регистратор", Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаботаХимцехаСрезПоследних.Период КАК Период,
	|	РаботаХимцехаСрезПоследних.Уровень КАК Уровень,
	|	РаботаХимцехаСрезПоследних.Концентрация КАК Концентрация,
	|	РаботаХимцехаСрезПоследних.ВремяРаботы КАК ВремяРаботы,
	|	РаботаХимцехаСрезПоследних.ВидРеагента КАК ВидРеагента,
	|	РаботаХимцехаСрезПоследних.Подразделение КАК Подразделение,
	|	РаботаХимцехаСрезПоследних.Включено КАК Включено,
	|	РаботаХимцехаСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.РаботаХимцеха.СрезПоследних(
	|			&Период,
	|			Оборудование = &Оборудование
	|				И ВидЗаписи = &ВидЗаписи) КАК РаботаХимцехаСрезПоследних");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	Запрос.УстановитьПараметр("ВидЗаписи",    ВидЗаписи);
	Запрос.УстановитьПараметр("Период",       Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат СостояниеОборудования;
	
КонецФункции