
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Коэффициент = 1;
		Если Параметры.ЗначенияЗаполнения.Свойство("ЕдиницаПоКлассификатору") Тогда
			Объект.Наименование = Параметры.ЗначенияЗаполнения.ЕдиницаПоКлассификатору;
		КонецЕсли;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Элементы.БазоваяЕдиницаИзмерения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаПоКлассификаторуПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ЕдиницаПоКлассификатору) Тогда
		Объект.Наименование = Объект.ЕдиницаПоКлассификатору;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.БазоваяЕдиницаИзмерения) Тогда
		Объект.БазоваяЕдиницаИзмерения = Объект.ЕдиницаПоКлассификатору;
	КонецЕсли;
	
КонецПроцедуры
