Процедура ПоказатьИнформациюПоРапорту(ДополнительныеПараметры, Форма) Экспорт 
	
	ОписаниеОповещения = новый ОписаниеОповещения("ОткрытьДокументЗавершение", РапортКлиент, ДополнительныеПараметры);
	ТекстВопроса = "Документ " + ДополнительныеПараметры.СинонимДокумента + " сегодня уже был создан. Открыть этот документ?";
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ОткрытьДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ДополнительныеПараметры.ДокументРапорта);
		ОткрытьФорму("Документ." + ДополнительныеПараметры.ИмяДокумента + ".Форма.ФормаДокумента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры