
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("ПросмотрИзменениеРегистраСведенийПартииРеагентовВИспользовании") 
		И Не РольДоступна("ПолныеПрава") Тогда
		Элементы.СписокУстановитьПартиюВИспользовании.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПартиюВИспользованииНаСервере(Партия, Дата, ВидРеагента, Отказ)
	
	Документы.ПриходРеагента.УстановитьПартиюВИспользованииНаСервере(Партия, Дата, ВидРеагента, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПартиюВИспользовании(Команда)
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные.Свойство("Ссылка") Тогда
		Оповещение = Новый ОписаниеОповещения("ПриВводеДатыИспользованияПартии", ЭтотОбъект, ТекДанные);
		ПоказатьВводЗначения(Оповещение, ТекущаяДата(), "Период, с которого используется партия", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВводеДатыИспользованияПартии(ВведенноеЗначение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВведенноеЗначение) Тогда
		Отказ = Ложь;
		УстановитьПартиюВИспользованииНаСервере(ДопПараметры.Ссылка, ВведенноеЗначение, ДопПараметры.ВидРеагента, Отказ);
		Если Не Отказ Тогда
			Элементы.Список.Обновить();
			Оповестить("ОбновитьТекущиеПартии");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

