
//&НаКлиенте
//Процедура СоставСтаршийСменыПриИзменении(Элемент)
//	
//	Для Каждого Стр Из Объект.Состав Цикл
//		
//		Если Элементы.Состав.ТекущиеДанные <> Стр Тогда
//			Стр.СтаршийСмены = Ложь;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подбор(Команда)
//	
//	Настройки = Новый НастройкиКомпоновкиДанных;
// 
//    ЭлементНастройки = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//    ЭлементНастройки.Использование = Истина;
//    ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
//    ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
//    ЭлементНастройки.ПравоеЗначение = ПолучитьПодразделение();
//    ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
//	
//    ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
//	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
//     
//	Форма = ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыФормы, ЭтаФорма); 
//	Форма.АвтоЗаголовок = Ложь;
//	Форма.Заголовок = "Подбор сотрудников для вахты " + Объект.Ссылка;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьПодразделение()
//	
//	Возврат ПараметрыСеанса.ТекущийПользователь.Подразделение;
//	
//КонецФункции

//&НаКлиенте
//Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
//	
//	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
//		
//		Если Объект.Состав.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение)).Количество() > 0 Тогда
//			ПоказатьПредупреждение(,"Данный сотрудник уже есть в табличной части!");
//			Возврат;
//		КонецЕсли;
//		
//		НовСтр = Объект.Состав.Добавить();
//		НовСтр.Сотрудник = ВыбранноеЗначение;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Если Объект.Ссылка.Пустая() Тогда
//		Объект.Владелец = ПараметрыСеанса.ТекущийПользователь.Подразделение;
//	КонецЕсли;
//	
//КонецПроцедуры
