
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ИспользованиеРеагентов 
	Движения.ИспользованиеРеагентов.Записывать = Истина;
	Для Каждого ТекСтрокаПлан Из План Цикл
		Движение = Движения.ИспользованиеРеагентов.Добавить();
		Движение.Период = ТекСтрокаПлан.Период;
		Движение.Сценарий = Сценарий;
		Движение.Организация = Организация;
		Движение.Реагент = ТекСтрокаПлан.Реагент;
		Движение.ВидРасхода = ТекСтрокаПлан.ВидРасхода;
		Движение.НаправлениеРасхода = ТекСтрокаПлан.НаправлениеРасхода;
		Движение.Подразделение = Подразделение;
		Движение.Количество = ТекСтрокаПлан.Количество;
		Движение.КоличествоВБазовойЕдинице = ТекСтрокаПлан.Количество;
	КонецЦикла;

КонецПроцедуры
