
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Отбор = Новый Структура("Событие", Объект.СобытиеПоУмолчанию); 
	//Если Объект.События.НайтиСтроки(Отбор).Количество() = 0 Тогда
	//	НовСтр = Объект.События.Добавить();
	//	НовСтр.Событие = Объект.СобытиеПоУмолчанию;
	//КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СобытияСобытиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//
	//Отбор = Новый Структура;
	//Отбор.Вставить("Организация", Объект.Организация);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("Отбор", Отбор);
	//
	//ОткрытьФорму("Справочник.События.ФормаВыбора", ПараметрыФормы,  Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры
