
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Сотрудник,
		|	ФизическиеЛица.ДатаКонтроляЗнаний КАК ДатаКонтроляЗнаний
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ИСТИНА
		|	И НЕ ФизическиеЛица.Уволен";
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		Запрос.Текст = Запрос.Текст + " И ФизическиеЛица.Подразделение.Организация = &Организация ";
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда 
		Запрос.Текст = Запрос.Текст + " И ФизическиеЛица.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "		
	    |
		|УПОРЯДОЧИТЬ ПО
		|	ФизическиеЛица.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.СписокСотрудников.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		Если ТекСтрока.Использовать Тогда 
			СотрудникОбъект = ТекСтрока.Сотрудник.ПолучитьОбъект();
			СотрудникОбъект.ДатаКонтроляЗнаний = ТекСтрока.ДатаКонтроляЗнаний;
			СотрудникОбъект.Обменданными.Загрузка = Истина;
			СотрудникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;		
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		ТекСтрока.Использовать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для каждого ТекСтрока Из Объект.СписокСотрудников Цикл
		ТекСтрока.Использовать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудниковДатаКонтроляЗнанийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокСотрудников.ТекущиеДанные;
	ТекущиеДанные.Использовать = ЗначениеЗаполнено(ТекущиеДанные.ДатаКонтроляЗнаний);
	
КонецПроцедуры
