&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ЭтоГруппа");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ЛевоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодразделенияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоПодразделению(Элементы.СписокПодразделения.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделению(Подразделение)
	
	ПолеОтбора    = Новый ПолеКомпоновкиДанных("Подразделение");	
	ЭлементОтбора = НайтиЭлементОтбораСпискаФизЛиц(ПолеОтбора);
	
	Если Подразделение = Неопределено Тогда
		Если ЭлементОтбора <> Неопределено Тогда
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	Иначе
		Если ЭлементОтбора = Неопределено Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = ПолеОтбора;
			//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		КонецЕсли;
		ЭлементОтбора.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.ПравоеЗначение = Подразделение.Ссылка;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиЭлементОтбораСпискаФизЛиц(ПолеОтбора)
	
	Для Каждого Элемент Из Список.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеОтбора Тогда
			Возврат Элемент;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры
