
Функция ПолучитьПараметрыОборудования(Дата, Оборудование, Отказ = Ложь) Экспорт
	
	Параметры = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОборудованиеХимЦехаСрезПоследних.Период КАК Период,
	|	ОборудованиеХимЦехаСрезПоследних.ВидРеагента КАК ВидРеагента,
	|	ОборудованиеХимЦехаСрезПоследних.Подразделение КАК Подразделение,
	|	ОборудованиеХимЦехаСрезПоследних.СостояниеОборудования КАК СостояниеОборудования,
	|	ОборудованиеХимЦехаСрезПоследних.ПлощадьОснования КАК ПлощадьОснования,
	|	ОборудованиеХимЦехаСрезПоследних.Объем КАК Объем,
	|	ОборудованиеХимЦехаСрезПоследних.Реагент КАК Реагент,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМинЗначениеУровня КАК КонтрольМинЗначениеУровня,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМаксЗначениеУровня КАК КонтрольМаксЗначениеУровня,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМинЗначениеКонцентрации КАК КонтрольМинЗначениеКонцентрации,
	|	ОборудованиеХимЦехаСрезПоследних.КонтрольМаксЗначениеКонцентрации КАК КонтрольМаксЗначениеКонцентрации,
	|	ОборудованиеХимЦехаСрезПоследних.РасходИЗакачкаОдновременно КАК РасходИЗакачкаОдновременно
	|ИЗ
	|	РегистрСведений.ОборудованиеХимЦеха.СрезПоследних(&Период, Оборудование = &Оборудование) КАК ОборудованиеХимЦехаСрезПоследних");
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СостояниеОборудования = Перечисления.СостоянияОборудования.ВРаботе Тогда
			
			Параметры = Новый Структура;
			
			Параметры.Вставить("Оборудование", Оборудование);
			Параметры.Вставить("Период", Выборка.Период);
			Параметры.Вставить("ВидРеагента", Выборка.ВидРеагента);
			Параметры.Вставить("Подразделение", Выборка.Подразделение);
			Параметры.Вставить("СостояниеОборудования", Выборка.СостояниеОборудования);
			Параметры.Вставить("ПлощадьОснования", Выборка.ПлощадьОснования);
			Параметры.Вставить("Объем", Выборка.Объем);
			Параметры.Вставить("Реагент", Выборка.Реагент);
			Параметры.Вставить("КонтрольМинЗначениеУровня", Выборка.КонтрольМинЗначениеУровня);
			Параметры.Вставить("КонтрольМаксЗначениеУровня", Выборка.КонтрольМаксЗначениеУровня);
			Параметры.Вставить("КонтрольМинЗначениеКонцентрации", Выборка.КонтрольМинЗначениеКонцентрации);
			Параметры.Вставить("КонтрольМаксЗначениеКонцентрации", Выборка.КонтрольМаксЗначениеКонцентрации);
			Параметры.Вставить("РасходИЗакачкаОдновременно", Выборка.РасходИЗакачкаОдновременно);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Использование даного оборудования невозможно, т.к. состояние оборудования %1", Выборка.СостояниеОборудования),,,, Отказ);
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Использование даного оборудования невозможно, т.к. оборудование не введено в эксплуатацию",,,,Отказ);
	КонецЕсли;
	
	Возврат Параметры;	
	
КонецФункции