Процедура УстановитьАвтоОтметкуНезаполненного(Форма) Экспорт
	
	Если ТипЗнч(Форма.Объект.Ссылка) = Тип("СправочникСсылка.Оборудование") Тогда
		Форма.Элементы.Родитель.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Форма.Объект.ВидОборудования);
		Форма.Элементы.Подразделение.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Форма.Объект.ВидОборудования);	
		Форма.Элементы.ВидОборудования.АвтоОтметкаНезаполненного = ЗначениеЗаполнено(Форма.Объект.ВидОборудования);	
	КонецЕсли;
	
КонецПроцедуры