
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
    
    Настройки = КомпоновщикНастроек.Настройки;  
	
	//ПараметрОборудование = Новый ПараметрКомпоновкиДанных("Оборудование");
	ПараметрОборудование = Настройки.ПараметрыДанных.Элементы.Найти("Оборудование");
	ПараметрОборудование.Значение = Оборудование;
	ПараметрОборудование.Использование = Истина;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);

    ДокументРезультат.Очистить();
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
