&НаСервере
Процедура ЗаполнитьБазовуюЕдиницу()
	
	Если Не ЗначениеЗаполнено(Запись.Реагент) Тогда
		БазоваяЕдиницаИзмеренияКонцентрации = Неопределено;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("ВидРеагента", Запись.Реагент.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
		БазоваяЕдиницаИзмеренияПлотности = Выборка.ЕдиницаИзмеренияПлотности;
	Иначе
		БазоваяЕдиницаИзмеренияКонцентрации = Неопределено;
		БазоваяЕдиницаИзмеренияПлотности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьБазовуюЕдиницу();
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	ЗаполнитьБазовуюЕдиницу();
КонецПроцедуры
