&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.СобытиеВЖурналеНСС.Видимость = Объект.ОповещениеНСС;
	Элементы.ГруппаЗаявки.Видимость = ОтображатьГруппуЗаявок();
	Элементы.СсылкаДляИзменения.Видимость = ЗначениеЗаполнено(Объект.СсылкаДляИзменения) И ОтображатьГруппуЗаявок();
	Элементы.ФормаИзменить.Видимость = Не Объект.Ссылка.Пустая() И (Не ЗначениеЗаполнено(Объект.Статус) ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.Утверждена"));
	Элементы.СсылкаДляИзменения.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеНССПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();   	
	
КонецПроцедуры

&НаСервере
Функция ОтображатьГруппуЗаявок()
	
	Возврат Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВИ++
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	//ВИ--
	
	//ВИ++
	//Заявки
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусыЗаявокСокращенный.НаРассмотрении;
	КонецЕсли;
	//ВИ--
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.События) Тогда
		Элементы.ФормаИзменить.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.Статус.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	ЭтаФорма.Закрыть();
	
	Форма = ПолучитьФорму("Справочник.События.Форма.ФормаЭлемента");
	ЗаполнитьЗначенияСвойств(Форма.Объект,Объект,,"Код"); 
	Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокСокращенный.НаРассмотрении");
	Форма.Объект.СсылкаДляИзменения = Объект.Ссылка;
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)     	
		
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Статус) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаДляИзмененияПриИзменении(Элемент)
	
	ИзменениеСсылкиСервер();
	
КонецПроцедуры      

&НаСервере
Процедура ИзменениеСсылкиСервер()
	
	Объект.Наименование = Объект.СсылкаДляИзменения.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ОповещениеНСС И Не ЗначениеЗаполнено(Объект.СобытиеВЖурналеНСС) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено значение события в журнале НСС ";
		Сообщение.Поле = "Объект.СобытиеВЖурналеНСС";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

















