
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Пользователь"));
	Если Не Параметр = Неопределено Тогда
		Параметр.Значение = ПользователиКлиентСервер.ТекущийПользователь();
		Параметр.Использование = Истина;
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВсеЗаявки"));
	Если Не Параметр = Неопределено Тогда
		Параметр.Значение = ПоказатьВсеЗаявки;
		Параметр.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры
