
&НаСервереБезКонтекста
Функция ПолучитьЗначениеРеквизита(Объект, Реквизит)
	Возврат Объект[Реквизит];
КонецФункции

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Объект.Организация = ПолучитьЗначениеРеквизита(Объект.Подразделение, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСтаршийСменыПриИзменении(Элемент)
		
	Для Каждого СтрТЧ Из Объект.Сотрудники Цикл
		Если СтрТЧ.ПолучитьИдентификатор() <> Элементы.Сотрудники.ТекущаяСтрока
			И СтрТЧ.Вахта = Элементы.Сотрудники.ТекущиеДанные.Вахта Тогда
			
			СтрТЧ.СтаршийСмены = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСотрудник = ВыбранноеЗначение;
	
	Если Не ПроверитьПодразделениеФизлица(ВыбранноеЗначение) Тогда
		ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Данный сотрудник не относится к подразделению %1", Объект.Подразделение));
		ТекСотрудник = Неопределено;
	КонецЕсли;
	
	Если СотрудникУволен(ВыбранноеЗначение) Тогда
		ПоказатьПредупреждение(, "Данный сотрудник уволен!");
		ТекСотрудник = Неопределено;
	КонецЕсли;
	
	Элемент = ТекСотрудник;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодразделениеФизлица(ФизЛицо)
	
	ТекПодразделение = ФизЛицо.Подразделение;
	ПроверкаПройдена = Ложь;
	
	Пока ЗначениеЗаполнено(ТекПодразделение) Цикл
		
		Если ТекПодразделение = Объект.Подразделение Тогда
			ПроверкаПройдена = Истина;
			Прервать;
		КонецЕсли;
		
		ТекПодразделение = ТекПодразделение.Родитель;
		
	КонецЦикла;
	
	Возврат ПроверкаПройдена;
	
КонецФункции

&НаСервере
Функция СотрудникУволен(Сотрудник)
	
	Возврат Сотрудник.Уволен;
	
КонецФункции

&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    
    ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
     
    ОткрытьФорму("Справочник.ФизическиеЛица.Форма.мФормаВыбораПростая", ПараметрыФормы, Элемент);
	
КонецПроцедуры
