
&НаСервере
Функция РассчитатьНаСервере()
	//Возврат Документы.ЗаписьЖурналаУчетаРеагентов.ЗаполнитьРасчетныеПоказателиСтрокиЖурнала(Объект);
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.РассчитатьРасход();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецФункции

&НаКлиенте
Процедура Рассчитать(Команда)
	//ПоказатьЗначение(, РассчитатьНаСервере());
	РассчитатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененаЗаписьЖургала", Новый Структура("Подразделение, Ссылка", Объект.Подразделение, Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура РасходЗавершенПриИзменении(Элемент)
	//Если Объект.РасходЗавершен Тогда
	//	Объект.РасходОтсечкаВремени = Ложь;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасходОтсечкаВремениПриИзменении(Элемент)
	Если Объект.РасходОтсечкаВремени Тогда
		Объект.РасходЗавершен = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаСервере
Процедура РеагентПриИзмененииНаСервере()
	
	Объект.ВидРеагента = Объект.Реагент.ВидРеагента;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	БазовыеЕдиницыИзмеренияРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности
	|ПОМЕСТИТЬ ВТ_БазовыеЕИ
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрЕдиницаИзмеренияКоличества.Ссылка КАК ЕдиницаИзмеренияКоличества,
	|	СпрЕдиницаИзмеренияКонцентрации.Ссылка КАК ЕдиницаИзмеренияКонцентрации,
	|	СпрЕдиницаИзмеренияПлотности.Ссылка КАК ЕдиницаИзмеренияПлотности
	|ИЗ
	|	ВТ_БазовыеЕИ КАК ВТ_БазовыеЕИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияКоличества
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияКоличества = СпрЕдиницаИзмеренияКоличества.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияКоличества.Владелец = &Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияКонцентрации
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияКонцентрации = СпрЕдиницаИзмеренияКонцентрации.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияКонцентрации.Владелец = &Владелец)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК СпрЕдиницаИзмеренияПлотности
	|		ПО ВТ_БазовыеЕИ.ЕдиницаИзмеренияПлотности = СпрЕдиницаИзмеренияПлотности.БазоваяЕдиницаИзмерения
	|			И (СпрЕдиницаИзмеренияПлотности.Владелец = &Владелец)");
	Запрос.УстановитьПараметр("Владелец",    Объект.Реагент);
	Запрос.УстановитьПараметр("ВидРеагента", Объект.ВидРеагента);
	
КонецПроцедуры

&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПартияПриИзменении(Элемент)
	
	ПартияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПартияПриИзмененииНаСервере()
	
	Объект.ЕдиницаИзмеренияПлотности    = Объект.Партия.ЕдиницаИзмеренияПлотности;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиПараметровАРМУчетаРеагентов.ЕдиницаИзмеренияКонцентрацииРаствора КАК ЕдиницаИзмеренияКонцентрацииРаствора,
	|	НастройкиПараметровАРМУчетаРеагентов.ЕдиницаИзмеренияПлотностиРаствора КАК ЕдиницаИзмеренияПлотностиРаствора,
	|	НастройкиПараметровАРМУчетаРеагентов.ВыполнятьКонтрольУровня КАК ВыполнятьКонтрольУровня
	|ИЗ
	|	РегистрСведений.НастройкиПараметровАРМУчетаРеагентов КАК НастройкиПараметровАРМУчетаРеагентов
	|ГДЕ
	|	НастройкиПараметровАРМУчетаРеагентов.Организация = &Организация
	|	И НастройкиПараметровАРМУчетаРеагентов.Реагент = &Реагент");
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Реагент", Объект.Реагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект.ЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрацииРаствора;
		Объект.ЕдиницаИзмеренияПлотности    = Выборка.ЕдиницаИзмеренияПлотностиРаствора;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РеагентПриИзмененииНаСервере();	
	Иначе
		
		Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("ИнженерХВО") Тогда
			ТолькоПросмотр = Истина;
			
			Если Параметры.Свойство("ДокументПриемаСмены") 
				И Параметры.ДокументПриемаСмены = Объект.ДокументПриемаСмены Тогда
				
				ТолькоПросмотр = Ложь;
				ТекущийПользовательАвтор = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТолькоПросмотр Или Не ПравоДоступа("Изменение", Метаданные.Документы.ЗаписьЖурналаУчетаРеагентов) Тогда
			Элементы.ФормаРассчитать.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКомментарийАвтрораИзменений()
	
	Комментарий = "";
	
	Если Объект.Комментарий1 <> Объект.Ссылка.Комментарий1 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий1, Объект.Ссылка.Комментарий1, "");
	КонецЕсли;
	
	Если Объект.Комментарий2 <> Объект.Ссылка.Комментарий2 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий2, Объект.Ссылка.Комментарий2, "");
	КонецЕсли;
	
	Если Объект.Комментарий3 <> Объект.Ссылка.Комментарий3 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий3, Объект.Ссылка.Комментарий3, "");
	КонецЕсли;
	
	Если Объект.Комментарий4 <> Объект.Ссылка.Комментарий4 Тогда
		Если Не ПустаяСтрока(Комментарий) Тогда
			Комментарий = Комментарий + "
				|";
		КонецЕсли;
		Комментарий = Комментарий + СтрЗаменить(Объект.Комментарий4, Объект.Ссылка.Комментарий4, "");
	КонецЕсли;
	
	Возврат СокрЛП(Комментарий);
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийПользовательАвтор Тогда
	
		Комментарий = ПолучитьКомментарийАвтрораИзменений();
		
		Если Не ПустаяСтрока(Комментарий) Тогда
			
			Объект.РучнаяКорректировка = Истина;
			
			НовСтр = ТекущийОбъект.Корректировки.Добавить();
			НовСтр.Автор = ПользователиКлиентСервер.ТекущийПользователь();
			НовСтр.Дата = ТекущаяДата();
			НовСтр.Комментарий = Комментарий;
			
			ТекущийОбъект.КомментарийАвтрораИзменений = Комментарий;
			
		Иначе
			
			Если Не РольДоступна("ПолныеПрава") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо указать причину корректировки",,,, Отказ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
