
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметр = История.Параметры.Элементы.Найти("Оборудование");
	Параметр.Значение = Параметры.КлючСтроки.Оборудование;
	Параметр.Использование = Истина;
	
	Параметр = История.Параметры.Элементы.Найти("Подразделение");
	Параметр.Значение = Параметры.КлючСтроки.Подразделение;
	Параметр.Использование = Истина;
	
	Параметр = История.Параметры.Элементы.Найти("НомерПоПорядку");
	Параметр.Значение = Параметры.КлючСтроки.НомерПоПорядку;
	Параметр.Использование = Истина;
	
КонецПроцедуры
