
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьКарточки)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьКарточки(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьКарточки(ТабДок, ПараметрКоманды)
	Документы.ОперативныйЖурнал.ПечатьКарточкиЗаписи(ТабДок, ПараметрКоманды);
КонецПроцедуры
