
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	//Подразделение
	ПараметрПодразделение = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("Подразделение");
	Если Не ПараметрПодразделение = Неопределено Тогда
		Подразделение = ПараметрПодразделение.Значение;
	КонецЕсли;
	
	//ПериодОтчета
	ПараметрПериодОтчета = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Если ЗначениеЗаполнено(ПараметрПериодОтчета.Значение) Тогда
		ПериодОтчета.ДатаНачала = ПараметрПериодОтчета.Значение.ДатаНачала;
		ПериодОтчета.ДатаОкончания = ПараметрПериодОтчета.Значение.ДатаОкончания;
	КонецЕсли; 	
	
КонецПроцедуры
