Функция Сформировать() Экспорт
	
	Макет = ПолучитьМакет("ОтчетОбИспользованииРеагентоов");
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока       = Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	ТабДок = Новый ТекстовыйДокумент;
	ОбластьЗаголовок.Параметры.Дата  = ДокументПриемаСмены.ДатаСобытия;
	ОбластьЗаголовок.Параметры.Смена = ДокументПриемаСмены.Смена;
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаписьЖурналаУчетаРеагентов.Ссылка КАК Ссылка,
	|	ЗаписьЖурналаУчетаРеагентов.ВерсияДанных КАК ВерсияДанных,
	|	ЗаписьЖурналаУчетаРеагентов.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗаписьЖурналаУчетаРеагентов.Номер КАК Номер,
	|	ЗаписьЖурналаУчетаРеагентов.Дата КАК Дата,
	|	ЗаписьЖурналаУчетаРеагентов.Проведен КАК Проведен,
	|	ЗаписьЖурналаУчетаРеагентов.Организация КАК Организация,
	|	ЗаписьЖурналаУчетаРеагентов.Подразделение КАК Подразделение,
	|	ЗаписьЖурналаУчетаРеагентов.Оборудование КАК Оборудование,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаНачалаЗакачки КАК ВахтаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаНачалаРасхода КАК ВахтаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаОкончанияЗакачки КАК ВахтаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВахтаОкончанияРасхода КАК ВахтаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ВидРеагента КАК ВидРеагента,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяЗакачки КАК ВремяЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяРасхода КАК ВремяРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаНачалаЗакачки КАК ДатаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаНачалаРасхода КАК ДатаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЗакачки КАК ДатаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияРасхода КАК ДатаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий1 КАК Комментарий1,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий2 КАК Комментарий2,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий3 КАК Комментарий3,
	|	ЗаписьЖурналаУчетаРеагентов.Комментарий4 КАК Комментарий4,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаНачалоЗакачки КАК КонцентрацияНаНачалоЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаНачалоРасхода КАК КонцентрацияНаНачалоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаОкончаниеЗакачки КАК КонцентрацияНаОкончаниеЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияНаОкончаниеРасхода КАК КонцентрацияНаОкончаниеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.КонцентрацияПоДокументам КАК КонцентрацияПоДокументам,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораЗакачка КАК ОбъемСработанногоРаствораЗакачка,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемСработанногоРаствораРасход КАК ОбъемСработанногоРаствораРасход,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйНачалаЗакачки КАК ОтветственныйНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйНачалаРасхода КАК ОтветственныйНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйОкончанияЗакачки КАК ОтветственныйОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ОтветственныйОкончанияРасхода КАК ОтветственныйОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ПлотностьПоТаблицам КАК ПлотностьПоТаблицам,
	|	ЗаписьЖурналаУчетаРеагентов.Расход КАК Расход,
	|	ЗаписьЖурналаУчетаРеагентов.РасходТоварногоРеагента КАК РасходТоварногоРеагента,
	|	ЗаписьЖурналаУчетаРеагентов.СменаНачалаЗакачки КАК СменаНачалаЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.СменаНачалаРасхода КАК СменаНачалаРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.СменаОкончанияЗакачки КАК СменаОкончанияЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.СменаОкончанияРасхода КАК СменаОкончанияРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаНачалоЗакачки КАК УровеньНаНачалоЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаНачалоРасхода КАК УровеньНаНачалоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаОкончаниеЗакачки КАК УровеньНаОкончаниеЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.УровеньНаОкончаниеРасхода КАК УровеньНаОкончаниеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияКоличества КАК ЕдиницаИзмеренияКоличества,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияКонцентрации КАК ЕдиницаИзмеренияКонцентрации,
	|	ЗаписьЖурналаУчетаРеагентов.ЕдиницаИзмеренияПлотности КАК ЕдиницаИзмеренияПлотности,
	|	ЗаписьЖурналаУчетаРеагентов.Партия КАК Партия,
	|	ЗаписьЖурналаУчетаРеагентов.ВидРасхода КАК ВидРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.НаправлениеРасхода КАК НаправлениеРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.Реагент КАК Реагент,
	|	ЗаписьЖурналаУчетаРеагентов.РучнаяКорректировка КАК РучнаяКорректировка,
	|	ЗаписьЖурналаУчетаРеагентов.ЗакачкаНачата КАК ЗакачкаНачата,
	|	ЗаписьЖурналаУчетаРеагентов.ЗакачкаЗавершена КАК ЗакачкаЗавершена,
	|	ЗаписьЖурналаУчетаРеагентов.РасходНачат КАК РасходНачат,
	|	ЗаписьЖурналаУчетаРеагентов.РасходЗавершен КАК РасходЗавершен,
	|	ЗаписьЖурналаУчетаРеагентов.ЗаписьОтменена КАК ЗаписьОтменена,
	|	ЗаписьЖурналаУчетаРеагентов.РассчитатьРасходВоВремяЗакачки КАК РассчитатьРасходВоВремяЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ВремяЧистогоРасхода КАК ВремяЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ОбъемЧистогоРасхода КАК ОбъемЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЧистойЗакачки КАК ДатаОкончанияЧистойЗакачки,
	|	ЗаписьЖурналаУчетаРеагентов.ДатаОкончанияЧистогоРасхода КАК ДатаОкончанияЧистогоРасхода,
	|	ЗаписьЖурналаУчетаРеагентов.НеВключатьВЖурнал КАК НеВключатьВЖурнал,
	|	ЗаписьЖурналаУчетаРеагентов.ДокументПриемаСмены КАК ДокументПриемаСмены,
	|	ЗаписьЖурналаУчетаРеагентов.КомментарийАвтрораИзменений КАК КомментарийАвтрораИзменений
	|ИЗ
	|	Документ.ЗаписьЖурналаУчетаРеагентов КАК ЗаписьЖурналаУчетаРеагентов
	|ГДЕ
	|	ЗаписьЖурналаУчетаРеагентов.ДокументПриемаСмены = &ДокументПриемаСмены
	|	И ЗаписьЖурналаУчетаРеагентов.Проведен
	|	И НЕ ЗаписьЖурналаУчетаРеагентов.ЗаписьОтменена
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаписьЖурналаУчетаРеагентов.Дата
	|ИТОГИ ПО
	|	ВидРеагента");
	Запрос.УстановитьПараметр("ДокументПриемаСмены", ДокументПриемаСмены);
	
	ВыборкаВидРеагента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидРеагента.Следующий() Цикл
		
		ОбластьШапкаТаблицы.Параметры.ВидРеагента = ВыборкаВидРеагента.ВидРеагента;
		ТабДок.Вывести(ОбластьШапкаТаблицы);
		
		Выборка = ВыборкаВидРеагента.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, "НАЧАЛО");
			ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, "ОКОНЧАНИЕ");
			
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПустаяСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура ЗаполнитьПараметрыСтрокиОтчета(Выборка, ОбластьСтрока, Операция)

	ОчиститьПараметрыСтроки(ОбластьСтрока);
	
	//Оборудование
	
	Если Операция = "НАЧАЛО" Тогда
		
		ОбластьСтрока.Параметры.Ооборудование	         = Выборка.Оборудование;
		ОбластьСтрока.Параметры.ВремяРасхода	         = Выборка.ДатаНачалаРасхода;
		ОбластьСтрока.Параметры.ВидНапр	                 = ?(ЗначениеЗаполнено(Выборка.НаправлениеРасхода), Выборка.НаправлениеРасхода, Выборка.ВидРасхода);
		ОбластьСтрока.Параметры.ОтвРасоход	             = Выборка.ОтветственныйНачалаРасхода;
		ОбластьСтрока.Параметры.ДлительностьРасоход	     = Выборка.ВремяРасхода;
		ОбластьСтрока.Параметры.УровеньРасход	         = Выборка.КонцентрацияНаНачалоРасхода;
		ОбластьСтрока.Параметры.КонцентрацияРасход	     = Выборка.КонцентрацияНаНачалоРасхода;
		ОбластьСтрока.Параметры.ОбъемСработанногоРасход	 = Выборка.ОбъемСработанногоРаствораРасход;
		ОбластьСтрока.Параметры.ВремяЗакачка	         = Выборка.ДатаНачалаЗакачки;
		ОбластьСтрока.Параметры.ОтвЗакачка	             = Выборка.ОтветственныйНачалаЗакачки;
		ОбластьСтрока.Параметры.ДлмтельностьЗакачка	     = Выборка.ВремяЗакачки;
		ОбластьСтрока.Параметры.УровеньЗакачка	         = Выборка.УровеньНаНачалоЗакачки;
		ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Выборка.КонцентрацияНаНачалоЗакачки;
		ОбластьСтрока.Параметры.ОбъемСработанногоЗакачка = Выборка.ОбъемСработанногоРаствораЗакачка;
		ОбластьСтрока.Параметры.Расход	                 = Выборка.Расход;
		ОбластьСтрока.Параметры.Партия                   = Выборка.Партия;
		
	ИначеЕсли Операция = "ОКОНЧАНИЕ" Тогда
		
		ОбластьСтрока.Параметры.УровеньРасход	         = Выборка.УровеньНаОкончаниеРасхода;
		ОбластьСтрока.Параметры.КонцентрацияРасход	     = Выборка.КонцентрацияНаОкончаниеРасхода;
		
		ОбластьСтрока.Параметры.УровеньЗакачка	         = Выборка.УровеньНаОкончаниеЗакачки;
		ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Выборка.КонцентрацияНаОкончаниеЗакачки;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ОчиститьПараметрыСтроки(ОбластьСтрока)

	ОбластьСтрока.Параметры.Ооборудование	         = Неопределено;
	ОбластьСтрока.Параметры.ВремяРасхода	         = Неопределено;
	ОбластьСтрока.Параметры.ВидНапр	                 = Неопределено;
	ОбластьСтрока.Параметры.ОтвРасоход	             = Неопределено;
	ОбластьСтрока.Параметры.ДлительностьРасоход	     = Неопределено;
	ОбластьСтрока.Параметры.УровеньРасход	         = Неопределено;
	ОбластьСтрока.Параметры.КонцентрацияРасход	     = Неопределено;
	ОбластьСтрока.Параметры.ОбъемСработанногоРасход	 = Неопределено;
	ОбластьСтрока.Параметры.ВремяЗакачка	         = Неопределено;
	ОбластьСтрока.Параметры.ОтвЗакачка	             = Неопределено;
	ОбластьСтрока.Параметры.ДлмтельностьЗакачка	     = Неопределено;
	ОбластьСтрока.Параметры.УровеньЗакачка	         = Неопределено;
	ОбластьСтрока.Параметры.КонцентрацияЗакачка	     = Неопределено;
	ОбластьСтрока.Параметры.ОбъемСработанногоЗакачка = Неопределено;
	ОбластьСтрока.Параметры.Расход	                 = Неопределено;
	ОбластьСтрока.Параметры.Партия                   = Неопределено;
	
КонецПроцедуры	