
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не Параметры.Отбор.Свойство("Организация") Тогда
	//	
	//	Для Каждого НастройкаКомпоновщика Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//		
	//		Если ТипЗнч(НастройкаКомпоновщика) = Тип("ОтборКомпоновкиДанных") Тогда
	//			
	//			Организация = Справочники.Оборудование.ПустаяСсылка();
	//			Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
	//				Организация = Параметры.ТекущаяСтрока.Организация;
	//			КонецЕсли;
	//			
	//			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
	//				НастройкаКомпоновщика,
	//				"Организация",
	//				Организация,
	//				ВидСравненияКомпоновкиДанных.Равно,
	//				,
	//				ЗначениеЗаполнено(Организация),
	//				РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,
	//				Новый УникальныйИдентификатор);
	//			
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	
	//КонецЕсли;
		
КонецПроцедуры
