
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки(); //СхемаКомпоновкиДанных.НастройкиПоУмолчанию; //
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для ИндСтроки = 1 По ДокументРезультат.ВысотаТаблицы Цикл
		
		ОбрИнд = ДокументРезультат.ВысотаТаблицы - ИндСтроки + 1;
		
		Если ДокументРезультат.Область(ОбрИнд, 1).Текст = "ПриходОстаток" Тогда
			ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область("r" + Формат(ОбрИнд, "ЧГ=")), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

