
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		Организация = ПолучитьОрганизациюПользователя(ТекущийПользователь.Подразделение);
		Ответственный = ТекущийПользователь;
		Подразделение = ТекущийПользователь.Подразделение;
		
		ЗаполнитьТабЧасть();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОрганизациюПользователя(Подразделение) 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подразделения.Организация КАК Организация
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка = &Подразделение
		|	И НЕ Подразделения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Организация;
	Иначе 
		Возврат Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьТабЧасть()
	
	Структура = ОперативныйЖурнал.ПолучитьСтруктуруОрганизаций();
	
	Список = Новый СписокЗначений;
	
	Если Организация = Структура.ИжевскаяТЭЦ1 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОборудования.Ссылка КАК ГруппаОборудования,
		|	ВЫБОР
		|		КОГДА ГруппыОборудования.Ссылка = &ОБ
		|			ТОГДА 1
		|		КОГДА ГруппыОборудования.Ссылка = &ПБ
		|			ТОГДА 2
		|		КОГДА ГруппыОборудования.Ссылка = &ВК
		|			ТОГДА 3
		|		КОГДА ГруппыОборудования.Ссылка = &РОУ
		|			ТОГДА 4
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.ГруппыОборудования КАК ГруппыОборудования
		|ГДЕ
		|	ГруппыОборудования.Ссылка В(&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		
		Список.Добавить(Справочники.ГруппыОборудования.ОБ);
		Список.Добавить(Справочники.ГруппыОборудования.ПБ);
		Список.Добавить(Справочники.ГруппыОборудования.ВК);
		Список.Добавить(Справочники.ГруппыОборудования.РОУ);
		
		Запрос.УстановитьПараметр("Список", Список);
		Запрос.УстановитьПараметр("ОБ", 	Справочники.ГруппыОборудования.ОБ);
		Запрос.УстановитьПараметр("ПБ", 	Справочники.ГруппыОборудования.ПБ);
		Запрос.УстановитьПараметр("ВК", 	Справочники.ГруппыОборудования.ВК);
		Запрос.УстановитьПараметр("РОУ", 	Справочники.ГруппыОборудования.РОУ);
		
		ЗначенияПоказателей.Загрузить(Запрос.Выполнить().Выгрузить());
						
	ИначеЕсли Организация = Структура.ИжевскаяТЭЦ2 Тогда 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыОборудования.Ссылка КАК ГруппаОборудования,
		|	ВЫБОР
		|		КОГДА ГруппыОборудования.Ссылка = &ОБ
		|			ТОГДА 1
		|		КОГДА ГруппыОборудования.Ссылка = &ПБ
		|			ТОГДА 2
		|		КОГДА ГруппыОборудования.Ссылка = &ВК
		|			ТОГДА 3
		|		КОГДА ГруппыОборудования.Ссылка = &РОУ
		|			ТОГДА 4
		|		КОГДА ГруппыОборудования.Ссылка = &РРОУ
		|			ТОГДА 5
		|		КОГДА ГруппыОборудования.Ссылка = &ПРРОУ
		|			ТОГДА 6
		|	КОНЕЦ КАК Порядок
		|ИЗ
		|	Справочник.ГруппыОборудования КАК ГруппыОборудования
		|ГДЕ
		|	ГруппыОборудования.Ссылка В(&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";

		Список.Добавить(Справочники.ГруппыОборудования.ОБ);
		Список.Добавить(Справочники.ГруппыОборудования.ПБ);
		Список.Добавить(Справочники.ГруппыОборудования.ВК);
		Список.Добавить(Справочники.ГруппыОборудования.РОУ);
		Список.Добавить(Справочники.ГруппыОборудования.РРОУ);
		Список.Добавить(Справочники.ГруппыОборудования.ПРРОУ);
		
		Запрос.УстановитьПараметр("Список", Список);
		Запрос.УстановитьПараметр("ОБ", 	Справочники.ГруппыОборудования.ОБ);
		Запрос.УстановитьПараметр("ПБ", 	Справочники.ГруппыОборудования.ПБ);
		Запрос.УстановитьПараметр("ВК", 	Справочники.ГруппыОборудования.ВК);
		Запрос.УстановитьПараметр("РОУ", 	Справочники.ГруппыОборудования.РОУ);
		Запрос.УстановитьПараметр("РРОУ", 	Справочники.ГруппыОборудования.РРОУ);
		Запрос.УстановитьПараметр("ПРРОУ", 	Справочники.ГруппыОборудования.ПРРОУ);

		Запрос.УстановитьПараметр("Список", Список);
		
		ЗначенияПоказателей.Загрузить(Запрос.Выполнить().Выгрузить());

		
	КонецЕсли;
	
КонецФункции
