
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КомплектУчетныхЕдиницПоУмолчанию.Организация КАК Организация,
		|	КомплектУчетныхЕдиницПоУмолчанию.Реагент КАК Реагент
		|ИЗ
		|	РегистрСведений.КомплектУчетныхЕдиницПоУмолчанию КАК КомплектУчетныхЕдиницПоУмолчанию
		|ГДЕ
		|	КомплектУчетныхЕдиницПоУмолчанию.Комплект = &Комплект");
		Запрос.УстановитьПараметр("Комплект", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МЗ = РегистрыСведений.КомплектУчетныхЕдиницПоУмолчанию.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Удалить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
