
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	//Виды Записей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперативныйЖурнал.ВидЗаписи КАК ВидЗаписи,
		|	ОперативныйЖурнал.Подразделение КАК Подразделение
		|ИЗ
		|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
		|ГДЕ
		|	ОперативныйЖурнал.Проведен
		|	И НЕ ОперативныйЖурнал.ВидЗаписи.Предопределенный
		|	И НЕ ОперативныйЖурнал.Событие = ЗНАЧЕНИЕ(Справочник.События.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЗаписи";
	
	Объект.ВидыЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//Таблица
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОперативныйЖурнал.ВидЗаписи КАК ВидЗаписи,
		|	ОперативныйЖурнал.Событие КАК Событие,
		|	ОперативныйЖурнал.Подразделение КАК Подразделение
		|ИЗ
		|	Документ.ОперативныйЖурнал КАК ОперативныйЖурнал
		|ГДЕ
		|	ОперативныйЖурнал.Проведен
		|	И НЕ ОперативныйЖурнал.ВидЗаписи.Предопределенный
		|	И НЕ ОперативныйЖурнал.Событие = ЗНАЧЕНИЕ(Справочник.События.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЗаписи";
	
	Объект.КПереносу.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Если Объект.КПереносу.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Таблица данных для переноса заполнена. Перезаполнить?", РежимДиалогаВопрос.ДаНет); 		
	КонецЕсли;
	Если Объект.КПереносу.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНаСервере(); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопрос(Ответ, ДопПарамтеры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.КПереносу.Очистить();
		ЗаполнитьТаблицуНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	
	Для Каждого ТекСтр Из Объект.ВидыЗаписей Цикл
		СтрокиОтбора = Объект.КПереносу.НайтиСтроки(Новый Структура("ВидЗаписи, Подразделение", ТекСтр.ВидЗаписи, ТекСтр.Подразделение));
		Если СтрокиОтбора.Количество() > 0 Тогда
			НовДок = НайтиДокумент(ТекСтр.ВидЗаписи, ТекСтр.Подразделение);
			Если НовДок = Неопределено Тогда
				НовДок = СоздатьНовыйДокумент(ТекСтр.Подразделение, ТекСтр.ВидЗаписи, СтрокиОтбора);
				СозданРанее = Ложь;
			Иначе
				СозданРанее = Истина;
			КонецЕсли;
			НовСтр = Объект.Документы.Добавить();
			НовСтр.Документ = НовДок;
			НовСтр.СозданРанее = СозданРанее;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйДокумент(Подразделение, ВидЗаписи, мСтроки)
	
	НовДок = Документы.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.СоздатьДокумент();
	НовДок.Дата = ТекущаяДата();
	НовДок.Организация = Подразделение.Организация;
	НовДок.Подразделение = Подразделение;
	НовДок.ВидЗаписи = ВидЗаписи;
	НовДок.СобытиеПоУмолчанию = мСтроки[0].Событие;
	НовДок.Комментарий = "Сформирован автоматически " + Формат(ТекущаяДата(), "ДЛФ=DD");
	
	Для Каждого ТекСтр Из мСтроки Цикл 
		НовСтр = НовДок.СписокСобытий.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
		НовСтр.Порядок = ТекСтр.НомерСтроки;
	КонецЦикла;
	
	Попытка
		НовДок.Записать(РежимЗаписиДокумента.Запись);
		Возврат НовДок.Ссылка;
	Исключение
		Сообщить("Не удалось сформировать документ для вида записи " + ВидЗаписи);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция НайтиДокумент(ВидЗаписи, Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением КАК ЗакреплениеВидаЗаписиИСобытийЗаПодразделением
		|ГДЕ
		|	НЕ ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.ПометкаУдаления
		|	И ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.Подразделение = &Подразделение
		|	И ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.ВидЗаписи = &ВидЗаписи";
	
	Запрос.УстановитьПараметр("ВидЗаписи", ВидЗаписи);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Объект.Документы.Очистить();
	СформироватьДокументыНаСервере();
	
	Элементы.Панель.ТекущаяСтраница = Элементы.СформированныеДокументы;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросОДокументах(Ответ, ДопПарамтеры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Документы.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры





